<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Ayuda de Sancabase</title>
<meta name="generator" content="Bluefish 1.0.7">
<meta name="author" content="Javier Castrillo">
<meta name="copyright" content="GPL - GNU Public License">
<meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
</head>
<body>
<table width='100%'>
<tr>
<td align='center'><b>Ayuda de Sancabase</b>
<br>Administrador de Centros <br>de Formaci&oacute;n Profesional
</td>
<td><img src="splash.jpg" width="247" height="55" border="0" alt="Splash"></td>
</tr>
<tr>
<td colspan="2">
<br><br>
<b>Men&uacute; ABM (Altas - Bajas - Modificaciones):</b><br>
Consta de los siguientes &iacute;tems:
<ul>
<li><b>Altas - Estudiantes:</b><br>
Se abrir&aacute; una ventana con dos pesta&ntilde;as y all&iacute; podremos ingresar todos los datos de cada estudiante, y esos datos se guardar&aacute;n en la base de datos. Los campos ingresados son los mismos que se piden en la c&eacute;dula escolar, y consiste en datos filiatorios, datos del responsable y cuestiones de salud.<br><center><img src="alta_estudiante.png" width="400" height="265" border="0" alt=""></center><br></li>
<li><b>Altas - Cursos:</b><br>
El formulario que aparecer&aacute; nos permite ingresar un curso nuevo. Se toma como referencia el n&uacute; del mismo, y posee un desplegable que contiene todo el nomenclador con los oficios, su cantidad de horas, el tipo de curso, fechas de inicio y fin, instructor responsable, centro y horarios en los que se dictar&aacute;. Luego podemos asignar de entre todos los estudiantes que tenemos en nuestra base de datos, aquellos que ser&aacute;n parte de este curso nuevo. Conviene pues ingresar todos los alumnos, los instructores y centros y luego dar de alta un curso. Los datos ingresados ser&aacute;n los que reflejen las actas de examen, ficha de curso y certificados de egresados.</li>
<li><b>Altas - Instructores:</b><br>
Aqu&iacute; ingresaremos a los docentes, con unos pocos datos de contacto.<br><center><img src="alta_instructor.png" width="400" height="265" border="0" alt="" align="middle"></center><br></li>
<li><b>Altas - Coordinadores:</b><br>
&Iacute;dem Alta de Instructores</li>
<li><b>Altas - Centros:</b><br>
Se ingresan ac&aacute; las diversas sedes de cada Centro de FP. Con sus responsables, domicilio, contacto, sitio web, etc.</li>
<li><b>Altas - Administrativos:</b><br>
&Iacute;dem Alta de Instructores</li>
<li><b>Altas - Auxiliares:</b><br>
&Iacute;dem Alta de Instructores</li>
<li><b>Altas - Legajo Social:</b><br>
Esta feature, sugerida por los coordinadores de los centros, permite hacer un legajo de diversos datos que no est&aacute;n en la c&eacute;dula escolar, pero que son de significativa importancia para el trabajo con estudiantes, ya que incluye su grupo familiar, sus estudios, antecedentes laborales, gustos, perspectivas, cuestiones legales, etc. Adem&aacute;s abre una hoja en blanco para poder escribir todo lo que se desee. Para poder abrir un legajo social, ese estudiante ya tiene que estar ingresado en el sistema, no se puede tener legajo social si no se tiene el alta com&uacute;n. No es necesario que un estudiante tenga legajo social. Los datos no se vuelcan en las planillas, sino que se toman para informaci&oacute;n interna de cada centro. Es decir que si hay dos domicilios diferentes, por ejemplo, el que se usar&aacute; en la ficha de curso, ser&aacute; la del alta de alumno, no la del legajo social.<br><center><img src="legajo_social.png" width="400" height="257" border="0" alt=""></center><br></li>
<li><b>Modificaciones - Estudiantes:</b><br>
El sistema solicitar&aacute; un apellido; mostrar&aacute; entonces un di&aacute;logo con todos los que tuvieren ese apellido, para poder seleccionar el estudiante que se modificar&aacute;. All&iacute; se abrir&aacute; una ventana similar a la de alta, pero ya precargada. Se modifica lo que se desea y se actualiza inmediatamente la base de datos.<br><center><img src="mod_estud.png" width="400" height="269" border="0" alt=""></center><br></li>
<li><b>Modificaciones - Cursos:</b><br>
Aqu&iacute; podemos cambiar los datos del curso, y (en desarrollo) los alumnos que est&aacute;n en cada uno de ellos. Pero para poder hacer esta &uacute;ltima tarea, usaremos la opci&oacute;n "Agregar estudiante a curso".</li>
<li><b>Modificaciones - Instructores:</b><br>
Para actualizar los datos de los docentes</li>
<li><b>Modificaciones - Coordinadores:</b><br>
&Iacute;dem modificaci&oacute;n de instructores</li>
<li><b>Modificaciones - Centros:</b><br>
Actualizaci&oacute;n de datos de una sede del centro</li>
<li><b>Modificaciones - Administrativos:</b><br>
&Iacute;dem modificaci&oacute;n de instructores</li>
<li><b>Modificaciones - Auxiliares:</b><br>
&Iacute;dem modificaci&oacute;n de instructores</li>
<li><b>Modificaciones - Legajo Social:</b><br>
Para actualizar, renovar datos, agregar informes y hacer entrevistas a los estudiantes que tuvieren legajo social.</li>
<li><b>Modificaciones - Agregar estudiante a curso:</b><br>
De manera interina, esta opci&oacute;n permite abrir un curso sin alumnos y luego ir agrgando a medida que se vayan anotando en el mismo.</li>
<li><b>Bajas y egresos - Fin de un curso:</b><br>
Si un curso termina antes del d&iacute;a previsto, se deber&aacute; consignar manualmente usando esta entrada del men&uacute;<br><center><img src="baja_curso.png" width="400" height="280" border="0" alt=""></center><br></li>
<li><b>Bajas y egresos - Deserci&oacute;n de estudiante:</b><br>
Cuando un estudiante deja un curso, se consigna en esta entrada. Pero cabe consignar que sus datos no se borrar&aacute;n de la base de datos, sino que se baja del curso, simplemente. Ning&uacute;n dato que se ha ingresado se borra por una baja.</li>
<li><b>Bajas y egresos - Seguimiento de egresado:</b><br>
Los centros que tienen la posibilidad de sistematizar las actividades de los estudiantes, es posible consignar si los mismos consiguieron empleo, y las cualidades del mismo.</li>
<li><b>Datos del Centro:</b><br>
Se ingresan en este &iacute;tem los datos del Centro de Formaci&oacute;n Profesional, no los de la sede. Cabe aclarar que los datos aqu&iacute; ingresados ser&aacute;n los que figurar&aacuten; en la documentaci&oacute;n que se genere.</li>
</ul>
<br>
</td>
</tr>
<tr>
<td colspan="2" align="center"><a href="index.html">Volver</a></td>
</tr>
</table>
</body>
</html>