<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>Ayuda de Sancabase</title>
<meta name="generator" content="Bluefish 1.0.7">
<meta name="author" content="Javier Castrillo">
<meta name="copyright" content="GPL - GNU Public License">
<meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
</head>
<body>
<table width='100%'>
<tr>
<td align='center'><b>Ayuda de Sancabase</b>
<br>Administrador de Centros <br>de Formaci&oacute;n Profesional
</td>
<td><img src="splash.jpg" width="247" height="55" border="0" alt="Splash"></td>
</tr>
<tr>
<td colspan="2">
<br><br>
<b>Men&uacute; "Aplicaci&oacute;n":</b>
<br>
Este men&uacute; permite realizar tareas intr&iacute;nsecas de la aplicaci&oacute;n de mantenimiento y seguridad:
<ul>
<li><b>Actualizar:</b><br>
Esta opci&oacute;n abre una ventana que se conecta al repositorio y baja las actualizaciones directamente desde el svn. Luego de hacerlo, es conveniente cerrar Sancabase para que los cambios tomen efecto al volver a iniciar la aplicaci&oacute;n<br><center><img src="actualizacion.png" width="300" height="199" border="0" alt=""></center><br></li>
<li><b>Exportar:</b><br>
Podremos desde esta feature, hacer una copia de seguridad de nuestra base de datos. Por defecto querr&aacute; guardar un archivo llamado escuela.sql, que se podr&aacute; guardar en cualquier lugar de la m&aacute;quina, aunque conviene hacerlo en un dispositivo USB, enviarlo por red, etc.<br><center><img src="backup_base.png" width="400" height="311" border="0" alt=""></center><br></li>
<li><b>Resguardo de planillas:</b><br>
Si bien "Exportar" hace un backup de la base de datos, no guarda los archivos del programa. Para poder guardar estos archivos, usamos esta opci&oacute;n. En la versi&oacute;n original de Sancabase, esta posibilidad est&aacute; hardcodeada para que sirva directamente a los miembros de la red de C&aacute;ritas del CFP 401 de Vicente L&oacute;pez, y no preguntar&aacute; en qu&eacute; lugar guardar el backup, sino que lo har&aacute; directamente en el pendrive provisto por el PNUD y que deber&aacute; conetarse antes de dar clic en el men&uacute;, en caso de error en el pendrive, mostrar&aacute; un mensaje de error.<br><center><img src="falla_backup.png" width="200" height="189" border="0" alt=""></center><br></li>
<li><b>Salir:</b><br>
Tal como el nombre indica, nos sacar&aacute; de Sancabase</li>
</ul>
</td>
</tr>
<tr>
<td colspan="2" align="center"><a href="index.html">Volver</a></td>
</tr>
</table>
</body>
</html>